In [46]:
# csv is comma separated file

In [47]:
import pandas as pd
sr =pd.read_csv("stock_data.csv", skiprows=1)  # skips one row
sr

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2  RIL   not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

In [48]:
hd = pd.read_csv("stock_data.csv", header=None)  # if you dont know the header name, use header= none to get the header as numbers.
hd

         0              1        2      3              4
0  tickers            eps  revenue  price         people
1    GOOGL          27.82       87    845     larry page
2      WMT           4.61      484     65           n.a.
3     MSFT             -1       85     64     bill gates
4     RIL   not available       50   1023  mukesh ambani
5     TATA            5.6       -1   n.a.     ratan tata

In [49]:
ti = pd.read_csv("stock_data.csv", names =["ticker","eps","revenue","price","people"])  # when you have a missing header and you want to provide name to different columns, use this.
ti

    ticker            eps  revenue  price         people
0  tickers            eps  revenue  price         people
1    GOOGL          27.82       87    845     larry page
2      WMT           4.61      484     65           n.a.
3     MSFT             -1       85     64     bill gates
4     RIL   not available       50   1023  mukesh ambani
5     TATA            5.6       -1   n.a.     ratan tata

In [50]:
nr = pd.read_csv("stock_data.csv", nrows=3) # in order to read certain no of rows from the data file use this.
nr

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

In [51]:
na = pd.read_csv("stock_data.csv", na_values=["not available","n.a."]) # to convert not available values to NaN use this
na

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [52]:
# you can also use dictionary in pandas to change the data.
ra = pd.read_csv("stock_data.csv", na_values={
 'eps' : ["not available","n.a."],
 'revenue' : ["not available","n.a.",-1],
 'price' : ["n.a."],
 'people' : ["n.a."],
})
ra

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [53]:
ra.to_csv("new.csv", index=False) # to export in a new csv file
ra

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [54]:
# use converter to change data in a column
import pandas as pd

def convert_people_cell(cell):
 if cell =="n.a.":
  return 'sam walton'
 return cell

def convert_eps_cell(cell):
 if cell == "not available":
  return None
 return cell

def convert_revenue_cell(cell):
 if cell == '87':
  return '69'
 return cell

sc = pd.read_csv("stock_data.csv", converters= {
 'people': convert_people_cell ,
 'eps': convert_eps_cell ,
 'revenue': convert_revenue_cell,
 })
sc

  tickers    eps revenue price         people
0   GOOGL  27.82      69   845     larry page
1     WMT   4.61     484    65     sam walton
2    MSFT     -1      85    64     bill gates
3    RIL    None      50  1023  mukesh ambani
4    TATA    5.6      -1  n.a.     ratan tata

In [55]:
# writing code back to excel file
sc.to_excel("new.xlsx", sheet_name = "stocks", startrow=1 , startcol=2)

In [56]:
# if you have 2 excel files and you want to use them in the same spreadsheet. 
df_stocks = pd.DataFrame({
    'tickers':['GOOGL','WMT','MSFT'],
    'price':[845,65,64],
    'pe':[30.37,14.26,30.97],
    'eps':[27.82,4.61,2.12]
})
df_weather = pd.DataFrame({
    'day':['1/1/2017','1/2/2017','1/3/2017'],
    'temperature':[32,35,28],
    'event':['Rain','Sunny','Snow'] })

In [57]:
with pd.ExcelWriter('stocks_weather.xlsx')as writer:
   df_stocks.to_excel(writer,sheet_name="stocks")
   df_weather.to_excel(writer,sheet_name="weather")